# IFCExtrusionCalculatorUtils Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCExtrusionCalculatorUtils Members
IFCExtrusionCalculatorUtils Class Methods See Also
---
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CalculateExtrusionData(IFCExtrusionCalculatorOptions, GeometryObject) | Calculates the extrusion data from a Revit geometry object. |
| CalculateExtrusionData(IFCExtrusionCalculatorOptions, IList<(Of <<'(Face>)>>)) |

# See Also
IFCExtrusionCalculatorUtils Class
Autodesk.Revit.DB.IFC Namespace